app/controllers/artworks_controller.rb

    def index
        user = User.find_by(id: params[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def update
        artwork = Artwork.find_by(id: params[:id])

        if artwork.update_attributes(artwork_params)
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "artworks" SET "image_url" = $1, "updated_at" = $2 WHERE "artworks"."id" = $3  [["image_url", "www.avrakadabra.com"], ["updated_at", "2020-06-24 18:53:43.875988"], ["id", 3]]

    def destroy
        artwork = Artwork.find_by(id: params[:id])
        if artwork
            artwork.destroy
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "artworks" WHERE "artworks"."id" = $1  [["id", 3]]

    def like
        like = Like.new(user_id: params[:user_id], likeable_id: params[:id], likeable_type: 'Artwork')
        if like.save
---
INSERT INTO "likes" ("user_id", "likeable_id", "created_at", "updated_at", "likeable_type") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["likeable_id", 1], ["created_at", "2020-06-24 21:15:00.452251"], ["updated_at", "2020-06-24 21:15:00.452251"], ["likeable_type", "Artwork"]]

    def unlike
        like = Like.find_by(user_id: params[:user_id], likeable_id: params[:id], likeable_type: 'Artwork')

        if like
            like.destroy
---
SELECT  "likes".* FROM "likes" WHERE "likes"."user_id" = $1 AND "likes"."likeable_id" = $2 AND "likes"."likeable_type" = $3 LIMIT $4  [["user_id", 1], ["likeable_id", 1], ["likeable_type", "Artwork"], ["LIMIT", 1]]
DELETE FROM "likes" WHERE "likes"."id" = $1  [["id", 1]]