app/controllers/comments_controller.rb

    def index
        if params[:user_id]
            comments = Comment.where(commenter_id: params[:user_id])
            render json: comments
        elsif params[:artwork_id]
            comments = Comment.where(artwork_id: params[:artwork_id])
---
SELECT "comments".* FROM "comments" WHERE "comments"."commenter_id" = $1  [["commenter_id", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."artwork_id" = $1  [["artwork_id", 1]]

    def create
        comment = Comment.new(comment_params)

        if comment.save
---
INSERT INTO "comments" ("commenter_id", "artwork_id", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["commenter_id", 1], ["artwork_id", 1], ["body", "Wow great picture"], ["created_at", "2020-06-24 19:52:44.067014"], ["updated_at", "2020-06-24 19:52:44.067014"]]

    def destroy
        comment = Comment.find_by(id: params[:id])
        if comment
            comment.destroy
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 1]]

    def like
        like = Like.new(user_id: params[:user_id], likeable_id: params[:id], likeable_type: 'Comment')

        if like.save
---
INSERT INTO "likes" ("user_id", "likeable_id", "created_at", "updated_at", "likeable_type") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["likeable_id", 2], ["created_at", "2020-06-24 21:19:05.944613"], ["updated_at", "2020-06-24 21:19:05.944613"], ["likeable_type", "Comment"]]

    def unlike
        like = Like.find_by(user_id: params[:user_id], likeable_id: params[:id], likeable_type: 'Comment')

        if like
            like.destroy
---
SELECT  "likes".* FROM "likes" WHERE "likes"."user_id" = $1 AND "likes"."likeable_id" = $2 AND "likes"."likeable_type" = $3 LIMIT $4  [["user_id", 1], ["likeable_id", 1], ["likeable_type", "Comment"], ["LIMIT", 1]]
DELETE FROM "likes" WHERE "likes"."id" = $1  [["id", 2]]