app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."username" = $1  [["username", "%sushil%"]]
SELECT "users".* FROM "users"
---
    def index
        if params[:query]
            users = User.where("username LIKE ?", "%#{params[:query]}%")
        else
            users = User.all
        end
        if users.length > 0

INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "\"alisha\""], ["email", "\"alisha@hotmail.com\""], ["created_at", "2020-06-24 16:58:05.294163"], ["updated_at", "2020-06-24 16:58:05.294163"]]
---
    def create
        user = User.new(user_params)
        if user.save!

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["name", "sushilt553"], ["updated_at", "2020-06-24 17:05:02.593113"], ["id", 1]]
---
    def update
        user = User.find_by(id: params[:id])

        if user.update_attributes(user_params)